{
    "KNPE 125": {
        "code": "KNPE 125",
        "title": "Introduction to Human Physiology",
        "description": "This course provides an introduction to human physiology from the cellular to the systematic level with special emphasis on the systems that adapt to exercise stress. The following areas will be covered: the cell, nervous system, skeletal muscle system, respiratory system, cardiovascular system, neuroendocrine system, and renal system.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "IDIS 150",
            "PHGY 210",
            "PHGY 212",
            "PHGY 214",
            [
                "PHGY 215",
                "PHGY 216"
            ]
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 153": {
        "code": "KNPE 153",
        "title": "Introductory Biomechanics",
        "description": "This course will present the fundamentals of biomechanics, including forces and moments, linear kinematics and kinetics, and work, power, and energy. Biomechanical tools and techniques used to assess human movement will also be introduced.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 167": {
        "code": "KNPE 167",
        "title": "Socio-Cult Dimensions of Sport and Physical Activity",
        "description": "An introduction to sociological thinking about sport and physical activity. Among the topics to be discussed are: an exploration of what constitutes sport and under what conditions; how social relations of class, race, gender, and sexuality shape sport experiences; the business of sport; and the relationship between the media and sport.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 203": {
        "code": "KNPE 203",
        "title": "Coaching and Leadership in Sport",
        "description": "The course will explore the concepts of coaching and leadership in relation to sport. The course addresses topics such as theoretical models of coaching and leadership, coaching behaviours, coach education, and the role of coaches in promoting performance, participation, and personal development through sport.",
        "units": 3,
        "prerequisites": [
            "KNPE 265"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 225": {
        "code": "KNPE 225",
        "title": "Advanced Human Physiology",
        "description": "The emphasis will be placed on understanding the concept of homeostasis and the integrated control of cellular and organ responses involved in regulation to maintain homeostasis. Special emphasis will be placed on the systems that respond to exercise stress.",
        "units": 3,
        "prerequisites": [
            "KNPE 125"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "IDIS 150",
            "PHGY 210",
            "PHGY 212",
            "PHGY 214",
            [
                "PHGY 215",
                "PHGY 216"
            ]
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 227": {
        "code": "KNPE 227",
        "title": "Exercise Physiology",
        "description": "An introduction to the basic components of physiology as they apply to health, fitness and exercise physiology.",
        "units": 3,
        "prerequisites": [
            "KNPE 125",
            "KNPE 225"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 237": {
        "code": "KNPE 237",
        "title": "Child and Adolescent Motor Development",
        "description": "This course is an exploration of behavioural and biological research on physical activity and how it relates to the psychosocial, structural, and physiological development of children between birth and approximately age 13.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 251": {
        "code": "KNPE 251",
        "title": "Introduction to Statistics",
        "description": "An introduction to the analysis of data from real life situations. Covers study design, descriptive and inferential statistics. Topics include probability, t-tests, regression, Chi-square tests, analysis of variance. Emphasis is in the foundation of statistical inference and practical application of statistical methods using statistical software.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "BIOL 243",
            "CHEE 209",
            "COMM 162",
            "ECON 250",
            "GPHY 247",
            "NURS 323",
            "PHED 251",
            "POLS 385",
            "PSYC 202",
            "SOCY 211",
            "STAM 200",
            "STAT 263",
            "STAT 267",
            "STAT 367"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 254": {
        "code": "KNPE 254",
        "title": "Biomechanical Analysis of Human Movement",
        "description": "Students will use biomechanical principles that describe how forces cause movement, from whole-body motions to tissue level processes, in order to solve problems in human movement. Biomechanical techniques and tools will be discussed, with a focus on applications in clinical movement disorders and performance in sport and exercise.",
        "units": 3,
        "prerequisites": [
            "KNPE 153"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "KNPE 353"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 255": {
        "code": "KNPE 255",
        "title": "Physical Activity, Fitness and Health",
        "description": "An introduction to the interrelationships between physical activity, fitness and health. Current techniques for the measurement of health related fitness components, evaluation of diet, weight loss principles, psychological aspects of fitness and suitable activities for fitness development. Concepts related to prescription of physical activity and exercise counseling are introduced.",
        "units": 3,
        "prerequisites": [
            "KNPE 125"
        ],
        "corequisites": [
            "KNPE 225",
            "KNPE 227"
        ],
        "exclusions": [
            "HLTH 270"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 261": {
        "code": "KNPE 261",
        "title": "Theory of Motor Behaviour and Motor Learning",
        "description": "Students will understand motor skill acquisition principles and procedures available to optimize learning in physical activity programs. The principles and theories outlined in this course will provide students with a basic knowledge of sensorimotor behaviour for applications in physical education, kinesiology, and rehabilitation.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 265": {
        "code": "KNPE 265",
        "title": "Psychology of Sport and Exercise",
        "description": "This course will introduce both theoretical and applied/professional aspects of human social behaviour in sport and exercise settings.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "PSYC 100"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 300": {
        "code": "KNPE 300",
        "title": "Community-Based Internship",
        "description": "A community-based internship for Kinesiology and Physical Education students to apply knowledge gained in theory-based courses and develop a range of professional skills. Internship opportunities vary year to year, subject to availability of an appropriate placement in a relevant workplace setting.\nNOTE Students are expected to participate in professional development workshops offered by the SKHS Student Experience Coordinator and Career Services.",
        "units": 3,
        "prerequisites": [
            "None"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "HLTH 300",
            "KNPE 330",
            "KNPE 346"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 327": {
        "code": "KNPE 327",
        "title": "Exercise Physiology Laboratory",
        "description": "A laboratory experience designed to establish understanding of, and technical skills in, the measurement of human physiological responses and performance capacity in exercise. Students will develop familiarity with tests of physiological function during rest and exercise in preparation for work in human performance, clinical and medical settings.\nNOTE Priority given to students in Level 3 of the KINE Specialization Plan followed by students in Level 3 of the PHED Specialization Plan.",
        "units": 3,
        "prerequisites": [
            "KNPE 125",
            "KNPE 225",
            "KNPE 227"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 330": {
        "code": "KNPE 330",
        "title": "Athletic Therapy Field Placement",
        "description": "Under the tutelage of the Coordinator of Athletic Therapy Services, students will complete a field placement that involves assignment to a varsity team as a student trainer. Student trainers are responsible for onsite coverage of the team during competition and possibly during practices. The student trainers are also responsible for the taping needs of athletes on the team, and assisting with assessment and rehabilitation.\nNOTE Students must hold valid First Aid/CPR certification and proof of completion of Athletic Therapy experience (36 hours) in second year.",
        "units": 4.5,
        "prerequisites": [
            [
                "ANAT 315",
                "KNPE 331"
            ]
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "HLTH 300",
            "KNPE 300",
            "KNPE 346"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 331": {
        "code": "KNPE 331",
        "title": "Care and Prevention of Athletic Injuries",
        "description": "The care and prevention of common athletic injuries with emphasis placed on the practical portion of taping and wrapping of athletic trauma.\nNOTE Lab Materials: estimated cost $15.",
        "units": 3,
        "prerequisites": [
            "ANAT 315",
            "ANAT 316"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 335": {
        "code": "KNPE 335",
        "title": "Healthy Aging",
        "description": "This course looks at what happens to the body as we age, including an examination of the physiological, psychological and emotional changes that occur during the aging process. The role of a healthy lifestyle in achieving quality of life as we age is a key perspective.\nNOTE Also offered at the Bader International Study Centre. Learning Hours may vary.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 336": {
        "code": "KNPE 336",
        "title": "Community Field Placement in Disability and Physical Activity",
        "description": "Students gain experience assisting adults with a disability to engage in exercise. Students develop an understanding of the nature of disability, the benefits of exercise, factors that promote exercise participation, and appropriate exercise prescription.\nNOTE Students must hold valid First Aid/CPR certification and CPIC.\nNOTE Field Placement Uniform: estimated cost $25.",
        "units": 3,
        "prerequisites": [
            [
                "HLTH 200",
                "KNPE 255"
            ]
        ],
        "corequisites": [
            "HLTH 332"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 337": {
        "code": "KNPE 337",
        "title": "Physical Activity Promotion for Children and Youth",
        "description": "This course explores topics such as theoretical models of motivation, interest, and interpersonal behaviours, and the design, implementation, and provision of inclusive physical activity environments for children/youth. This course emphasizes the application of theory through activity-based classroom sessions and community placements.\nNOTE Transportation and other costs directly related to the student (e.g. required Criminal Checks) are the responsibility of the student.",
        "units": 3,
        "prerequisites": [
            [
                "KNPE 237",
                "HLTH 270"
            ]
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "PACT 237"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 338": {
        "code": "KNPE 338",
        "title": "Field Course in Kinesiology and Health Studies",
        "description": "This course will provide an intensive experiential learning opportunity for students. The emphasis is on hands-on application of various current topics in the fields of Kinesiology and Health Studies including but not limited to outdoor recreation, active living, health and the built environment, food systems, parasport, sport participation, fitness assessment and/or movement behaviours. Students will participate in field excursions and participate in a range of skill building activities to expose them to professional and community environments.\nNOTE Field Excursions: estimated cost $400.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 339": {
        "code": "KNPE 339",
        "title": "Advanced Exercise Metabolism",
        "description": "This course focuses on aspects of skeletal muscle energy metabolism related to exercise, with a particular emphasis on the regulation of carbohydrate and fat metabolism and the mechanisms regulating their use as substrates for muscle during rest and exercise.",
        "units": 3,
        "prerequisites": [
            "KNPE 225",
            "KNPE 227"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 345": {
        "code": "KNPE 345",
        "title": "The Science and Methodology of Sport Training Conditioning Programs",
        "description": "This course focuses on the development of sport conditioning programs from periodization concepts to specific training components and how the components can be integrated to create a comprehensive and balanced athlete training plan. Laboratory sessions will work on skill development applicable to conducting training and conditioning programs.",
        "units": 3,
        "prerequisites": [
            "KNPE 227"
        ],
        "corequisites": [
            "KNPE 254"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 346": {
        "code": "KNPE 346",
        "title": "Strength and Conditioning Field Placement",
        "description": "Under the tutelage of the Strength and Conditioning Coordinator, students will complete a field placement that involves a range of practical experiences in the area of strength and conditioning programs for elite athletes. Practical sessions will be rotated weekly in order to provide students with a variety of experiences in program delivery, training sessions, and testing.\nNOTE Students must hold valid First Aid/CPR certification.",
        "units": 4.5,
        "prerequisites": [
            [
                "ANAT 315",
                "KNPE 345"
            ]
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "HLTH 300",
            "KNPE 300",
            "KNPE 330"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 349": {
        "code": "KNPE 349",
        "title": "Sports Nutrition",
        "description": "This course will provide foundational knowledge of the basic physiological pathways that support energy production during endurance-type and resistance-type exercise. Students will investigate, evaluate and develop nutritional interventions to potentiate energy systems and promote post-exercise recovery.\nNOTE Nutrition Software: estimated cost $75.",
        "units": 3,
        "prerequisites": [
            "KNPE 227",
            "KNPE 255"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 352": {
        "code": "KNPE 352",
        "title": "Research Skills Development Practicum",
        "description": "A practicum for students in Kinesiology and Physical Education working in the research labs and on research projects of SKHS faculty members. Includes a seminar series covering research topics and methodologies in: Applied Exercise Science, Epidemiology, Health Promotion, Psychology of Sport and Physical Activity, and Sociology of Sport and Health.\nNOTE Students will apply for a research-based practicum at the end of their second year. Recommended for students who intend to complete KNPE 595.",
        "units": 3,
        "prerequisites": [
            "KNPE 251"
        ],
        "corequisites": [
            "HLTH 252"
        ],
        "exclusions": [
            "HLTH 352"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 354": {
        "code": "KNPE 354",
        "title": "Occupational Biomechanics and Physical Ergonomics",
        "description": "An introduction to occupational biomechanics and physical ergonomics. The course will apply principles of biomechanics to describe relationships between job demands, functional/tissue capacities and work-related injury. Demand, capacity and injury risk evaluation tools will also be presented.",
        "units": 3,
        "prerequisites": [
            "KNPE 254"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 355": {
        "code": "KNPE 355",
        "title": "Lifestyle and Cardiometabolic Assessment Laboratory",
        "description": "A lecture/laboratory experience designed to help prepare students to participate in a variety of multidisciplinary clinical and/or professional environments. Concept and skill development pertaining to exercise/lifestyle for general as well as selected special populations will prepare students for experiences in clinical and medical settings.",
        "units": 3,
        "prerequisites": [
            "KNPE 125",
            "KNPE 225",
            "KNPE 227",
            "KNPE 255"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 363": {
        "code": "KNPE 363",
        "title": "Team Dynamics in Sport: Theory and Practice",
        "description": "This course explores group dynamics in sport and involves the integration of theory, research, and practice. Topics include team structure (e.g. roles). it processes (e.g., communication), and emergent states (e.g., cohesion). Students will be encouraged to critically analyze the body of research and discuss relevant practical implications.",
        "units": 3,
        "prerequisites": [
            "KNPE 265"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 365": {
        "code": "KNPE 365",
        "title": "Motivational Interviewing for Physical Activity Behaviour Change",
        "description": "Study of strategies to enhance intrinsic motivation and self-regulation for physical activity and health behaviour change in clinical settings. Students will learn and practice motivational interviewing skills for behaviour change in intensive weekly tutorial sessions.",
        "units": 3,
        "prerequisites": [
            "PSYC 100",
            [
                "KNPE 265",
                "HLTH 315"
            ]
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 366": {
        "code": "KNPE 366",
        "title": "Race, Sport and Physical Activity",
        "description": "This course offers a critical exploration into how the social construction of race affects sport, health, and physical activity cultures, how sport may influence our understanding of race in society. We discuss how racism exists in these sporting spaces. The end goal is to understand how sport and health practitioners can incorporate anti-racism work.",
        "units": 3,
        "prerequisites": [
            [
                "KNPE 167",
                "HLTH 101"
            ]
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "KNPE 397"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 367": {
        "code": "KNPE 367",
        "title": "Fitness, the Body and Culture",
        "description": "This course looks at the ways that notions of fitness are tied to historically specific ideas about the body. The course focuses on ideas about race, class, gender, ability and sexuality while addressing the politics of fitness and exercise and their relationship to social, economic, and cultural institutions.",
        "units": 3,
        "prerequisites": [
            "KNPE 167",
            "SOCY 221",
            [
                "SOCY 226",
                "SOCY 227"
            ]
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 397": {
        "code": "KNPE 397",
        "title": "Special Topics in Kinesiology",
        "description": "Intensive coverage of topics that are current and/or of special interest in the area of Kinesiology. Offered periodically.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 400": {
        "code": "KNPE 400",
        "title": "Professional Issues in Allied Health",
        "description": "Through problem-based learning, students will gain an understanding of what it means to be an applied health care professional. Students will work collaboratively on case studies and develop critical thinking skills to prepare them as they transition to their careers as health care practitioners.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 425": {
        "code": "KNPE 425",
        "title": "Physiology of Stress",
        "description": "An in-depth exploration of physiological responses to primarily psychological sources of stress. An emphasis is placed on understanding the interaction between stress responses and function/health and the action of selected stress management techniques.",
        "units": 3,
        "prerequisites": [
            "KNPE 225",
            "KNPE 227"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "KNPE 493"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 429": {
        "code": "KNPE 429",
        "title": "Skeletal Muscle Oxygen Delivery: Demand Matching in Exercise",
        "description": "The focus of this course is to develop an advanced understanding of cardiovascular and respiratory responses in meeting oxygen demand of exercising skeletal muscle. Topics: oxygen delivery in exercising skeletal muscle metabolism/contraction; compromised exercise performance in selected diseases; mechanisms of enhancement of exercise tolerance.",
        "units": 3,
        "prerequisites": [
            "KNPE 125",
            "KNPE 225",
            "KNPE 227"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 430": {
        "code": "KNPE 430",
        "title": "Athletic Therapy Internship",
        "description": "Working with the Coordinator of Athletic Therapy (AT), and building on the practical skills and knowledge acquired in KNPE 330, students will complete an Athletic Therapy internship. AT interns will be responsible for serving as a mentor to student trainers and onsite trainers in the Athletic Therapy clinic and at varsity events. They will also serve as teaching assistants in the laboratory component of KNPE 331.\nNOTE Valid First Aid/CPR Certification required.",
        "units": 4.5,
        "prerequisites": [
            "KNPE 330"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 433": {
        "code": "KNPE 433",
        "title": "Global Sport and Disability",
        "description": "The UN recognizes the important role of sport participation in promoting physical and mental health as well as fundamental human rights. This course will critique the use of sport and recreation on a global level as a tool for improving the lives of people with disabilities with the goal of removing barriers and enabling participation for all.\nNOTE Also offered at the Bader International Study Centre. Learning Hours may vary.",
        "units": 3,
        "prerequisites": [
            "HLTH 332"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "HLTH 497"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 436": {
        "code": "KNPE 436",
        "title": "Advanced Placement in Disability and Physical Activity",
        "description": "Students gain leadership experience in an exercise program for adults with a disability. Students develop an understanding of the operational considerations to run an adapted exercise program including the necessary human and financial resources, and the skills to develop, implement, and evaluate exercise opportunities for persons with a disability.\nNOTE Students must hold valid First Aid/CPR certification and CPIC.\nNOTE Field Placement Uniform: estimated cost $25.",
        "units": 3,
        "prerequisites": [
            "KNPE 336"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 439": {
        "code": "KNPE 439",
        "title": "Critical Appraisal and Translation of Muscle Physiology Research",
        "description": "In this course students will read, evaluate and discuss recent scientific literature in the areas of exercise metabolism, exercise nutrition, and performance. Students will develop a systematic approach to scientific writing and write translational literature that accurately communicates recent scientific findings to the general population.",
        "units": 3,
        "prerequisites": [
            "KNPE 339"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "KNPE 493"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 446": {
        "code": "KNPE 446",
        "title": "Strength and Conditioning Internship",
        "description": "Building on the skills and knowledge acquired in KNPE 346, students will complete a Strength and Conditioning (SC) internship with a varsity team. SC interns will be responsible for the design and implementation of training programs, functional screening, and athlete injury management. They will also assist with the Complete Athlete program and contribute to the laboratory component of KNPE 345 as TA's.\nNOTE Valid First Aid/CPR Certification required.",
        "units": 4.5,
        "prerequisites": [
            "KNPE 346"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 449": {
        "code": "KNPE 449",
        "title": "Advanced Protein Metabolism",
        "description": "This course will provide an understanding of the factors that regulate the size of human skeletal muscle. Emphasis will be on how nutrition and exercise affect skeletal muscle growth/loss and insight into the use of isotopic labeling and other contemporary laboratory-based techniques used to study human skeletal muscle protein turnover.\nNOTE Nutrition software package: estimated cost $75.",
        "units": 3,
        "prerequisites": [
            [
                "HLTH 331",
                "KNPE 349"
            ]
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "KNPE 493"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 450": {
        "code": "KNPE 450",
        "title": "Ergonomics",
        "description": "This is an interdisciplinary lecture/seminar course designed to provide a comprehensive overview of ergonomics emphasizing applications to product design and prevention of musculoskeletal injuries. The focus includes anthropometry, workplace design, and biomechanical and other human factors. Ergonomic assessment methodologies will be used to assess design features and possible musculoskeletal problems.",
        "units": 3,
        "prerequisites": [
            [
                [
                    "ANAT 101",
                    "ANAT 315"
                ],
                [
                    "KNPE 254"
                ]
            ]
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "MECH 495",
            "RHBS 428"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 454": {
        "code": "KNPE 454",
        "title": "Clinical Biomechanics",
        "description": "This advanced course will present the general biomechanical techniques used in clinical evaluation. This will be followed by assessment techniques, how assessment is done, and how the results of assessment can be used to evaluate performance and the effectiveness of treatment.",
        "units": 3,
        "prerequisites": [
            "KNPE 254"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 455": {
        "code": "KNPE 455",
        "title": "Advanced Physical Activity and Health",
        "description": "Provides advanced understanding of concepts related to the use of physical activity/lifestyle as a strategy for reducing morbidity and mortality in general and selected special populations in preparation to participate in a variety of multidisciplinary clinical and/or professional health care environments.\nNOTE This course will normally be offered in academic years starting with an odd number (eg., 2013-2014). Students in a KINE Plan will have priority over students in a PHED Plan.",
        "units": 3,
        "prerequisites": [
            "KNPE 125",
            "KNPE 225",
            "KNPE 227",
            "KNPE 255"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 456": {
        "code": "KNPE 456",
        "title": "Survey of Research and Literature in Kinesiology and Physical Education",
        "description": "Independent study involving a critical review of the literature on an approved topic of specialization in health enhancement, disease prevention and human performance. Students must arrange for a faculty adviser approved by the School of Kinesiology and Health Studies.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 459": {
        "code": "KNPE 459",
        "title": "Clinical Exercise Physiology",
        "description": "An in-depth coverage of principles of health screening, exercise testing and exercise prescription for individuals with cardiovascular, metabolic and pulmonary diseases. An emphasis is placed on understanding disease pathophysiology and how this interacts with the acute response to exercise and the adaptation to training.\nNOTE This course will normally be offered in academic years starting with an even number (e.g., 2012-2013). Students in a KINE Specialization Plan will have priority over students in a PHED Specialization Plan.",
        "units": 3,
        "prerequisites": [
            "KNPE 125",
            "KNPE 225",
            "KNPE 227"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 463": {
        "code": "KNPE 463",
        "title": "Community-Based Physical Activity Promotion",
        "description": "Program planning and evaluation for the promotion of physical activity in the community, workplace, school, and health care settings. Using a combination of lecture, group discussions, and a community-based placement, students will acquire the skills and understand the philosophies used in promoting physical activity involvement in the community.",
        "units": 6,
        "prerequisites": [
            "KNPE 265"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 465": {
        "code": "KNPE 465",
        "title": "Sport Participation and Performance",
        "description": "An exploration of the theoretical and empirical work in the development of sport participation and performance. Specific discussion of the developmental aspects and learning conditions that allow individuals to maintain participation and reach high levels of excellence in sport will be included.",
        "units": 3,
        "prerequisites": [
            "KNPE 265"
        ],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 473": {
        "code": "KNPE 473",
        "title": "Sport and Culture",
        "description": "This course draws on critical theories to look at sport in Western cultures. It examines sport's contribution to systems of gender, race, class, sexuality and ability. Topics include sport's relationship to nationalism, media, commodification, globalization, and the environment.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 491": {
        "code": "KNPE 491",
        "title": "Special Project in Kinesiology and Physical Education",
        "description": "This is an independent project in an area of specialization in health enhancement, disease prevention and human performance. Students must arrange for a faculty advisor approved by the School of Kinesiology and Health Studies to oversee their project.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 493": {
        "code": "KNPE 493",
        "title": "Special Topics in Kinesiology and Physical Education",
        "description": "Intensive coverage of advanced topics that are current and/or of special interest in Kinesiology.\nNOTE Offered periodically by visiting professors or members of faculty. Students should check with the School regarding availability of this course.",
        "units": 3,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    },
    "KNPE 595": {
        "code": "KNPE 595",
        "title": "Honours Thesis in Kinesiology and Physical Education",
        "description": "An independent study involving a research proposal and project on an approved topic in the area of health enhancement, disease prevention, and human performance. The research proposal will be completed in the Fall Term and research project in the Winter Term. Students must arrange for a full-time faculty advisor in the School of Kinesiology and Health Studies.",
        "units": 6,
        "prerequisites": [],
        "corequisites": [
            "None"
        ],
        "exclusions": [
            "None"
        ],
        "one_way_exclusions": [
            "None"
        ]
    }
}